src/Documents/ЗаявкаГандива/ЗаявкаГандива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаГандива</name>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ОтделГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорияГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидГандива</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийТелефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКомпьютера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачГандива</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Наблюдатель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/узОформлениеТекста/узОформлениеТекста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5b6ff570-62c2-42f4-b206-490e1bcf32b1">
  <name>узОформлениеТекста</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5168d756-f8ea-443f-8c5f-872e36c99078">
    <name>Текст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a461176e-9a50-4392-9bcd-7d6235770fe6">
    <name>ФорматированныйТекст</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c2259309-194f-42bf-a86b-b93f5c5a2b50">
    <name>Markdown</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаГандива/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	РегламентГандива.ОбновитьТокенГандива();
	Коменты = РегламентГандива.ОтправитьЗапросГандива("/Requests/"+СтрЗаменить(Строка(Объект.Номер),Символы.НПП,"")+"/Comments","GET",, Истина);
	КоментыСрук = РегламентГандива.ПолучитьСтруктуруИзСоответствия(Коменты);
	Если КоментыСрук.Количество() > 0 Тогда
		Объект.Комментарии.Очистить();
		Для каждого стр из КоментыСрук Цикл
			нСтр = Объект.Комментарии.Добавить();
			нСтр.Отправитель = РегламентГандива.СоздатьИлиНайтиПользователя(стр.Author);
			нСтр.Комментарий = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(стр.Text,"<p>",""),"<br />",Символы.ПС),"</p>",Символы.ПС),"&nbsp"," ");
			нСтр.ID = стр.Id;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Объект.ОформлениеТекста = ПолучитьФорматТекст(); 
	ОформлениеТекстаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьФорматТекст()
	
	Возврат Перечисления.узОформлениеТекста.ФорматированныйТекст;
	
КонецФункции


&НаКлиенте
Процедура ЗапросКоментария(Команда)
 
    Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", 
      ЭтотОбъект);	
 
    ПоказатьВводЗначения(
        Оповещение,
        , // пропускаем начальное значение
        "Напишите комментарий",
        "Строка"
    );
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВводаЗначения(Результат, Параметры) Экспорт	
	
	Если Не Результат = Неопределено Тогда
			ОтправитьКомментарийНаСервере(Результат);
			ПриОткрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ОтправитьКомментарийНаСервере(Комент)
	
	ТелоЗапроса = "{""parentCommentId"":0,""text"":"""+Строка(Комент)+""",""addressees"":[0]}";
		
		Результат = РегламентГандива.ОтправитьЗапросГандива(
		"/Requests/7421/Comments",
		"POST",
		ТелоЗапроса,
		Истина
		,Истина);
	
КонецФункции
